[
    {
      "id": "PL001",
      "title": "Python Programming Fundamentals",
      "price": 199.99,
      "credit_hour": 3,
      "description": "Learn the basics of Python programming from scratch. This comprehensive course covers everything from basic syntax to advanced topics like data manipulation and web development. Gain practical experience through coding exercises and real-world examples.",
      "image": "https://i.postimg.cc/2yHNbBKV/python.jpg"
    },
    {
      "id": "SE101",
      "title": "Introduction to Software Engineering",
      "price": 249.99,
      "credit_hour": 4,
      "description": "Explore the fundamental principles of software engineering. This extensive course takes you through the entire software development lifecycle, from requirements analysis to testing and maintenance. Learn about software design, architecture, and best practices and uses.",
      "image": "https://i.postimg.cc/YS7D7CdV/fotis-fotopoulos-6s-Al6a-Q4-OWI-unsplash.jpg"
    },
    {
      "id": "PL002",
      "title": "Java Programming Mastery",
      "price": 229.99,
      "credit_hour": 3,
      "description": "Master Java programming and object-oriented concepts. This in-depth course equips you with skills in multithreading, GUI programming, and data structures while building real-world Java applications. Suitable for beginners and experienced programmers alike.",
      "image": "https://i.postimg.cc/7Z5JL3WJ/java.jpg"
    },
    {
      "id": "SE201",
      "title": "Software Design Patterns",
      "price": 299.99,
      "credit_hour": 4,
      "description": "Learn popular software design patterns and best practices. This comprehensive course covers theory and real-world application of design patterns, helping you craft elegant and maintainable code. Elevate your software design skills.",
      "image": "https://i.postimg.cc/gc3ff1cn/design.jpg"
    },
    {
      "id": "PL003",
      "title": "Web Development with JavaScript",
      "price": 199.99,
      "credit_hour": 3,
      "description": "Build dynamic web applications using JavaScript. This immersive course covers client-side scripting, DOM manipulation, and server-side integration. Develop skills to create interactive websites and web apps.",
      "image": "https://i.postimg.cc/9F7r5mRy/js.jpg"
    },
    {
      "id": "SE301",
      "title": "Agile Software Development",
      "price": 279.99,
      "credit_hour": 4,
      "description": "Implement agile methodologies in software development. This comprehensive course teaches principles and practices, including Scrum and Kanban, for leading agile teams and delivering high-quality software products efficiently.",
      "image": "https://i.postimg.cc/cJpdcYhj/agile.jpg"
    },
    {
      "id": "PL004",
      "title": "C# Programming Essentials",
      "price": 219.99,
      "credit_hour": 3,
      "description": "Get started with C# programming and .NET development. This extensive course covers C# fundamentals, explores the .NET framework, and guides you in building Windows applications. Suitable for aspiring desktop or game developers.",
      "image": "https://i.postimg.cc/T1PNLNmX/c-sharp.jpg"
    },
    {
      "id": "SE401",
      "title": "Software Quality Assurance",
      "price": 259.99,
      "credit_hour": 4,
      "description": "Ensure software product quality with testing techniques. This comprehensive course equips you with knowledge and skills in various testing methodologies, automation, and best practices. Become an expert in software quality assurance.",
      "image": "https://i.postimg.cc/8kBrjPPD/quality.jpg"
    },
    {
      "id": "PL005",
      "title": "Ruby on Rails Web Development",
      "price": 209.99,
      "credit_hour": 3,
      "description": "Build web applications with Ruby on Rails framework. This extensive course delves into Ruby on Rails, enabling you to create dynamic, database-driven web applications. Suitable for both beginners and experienced developers.",
      "image": "https://i.postimg.cc/0j2m9LS7/ruby.png"
    }
  ]
  