[
    {
      "id": "PL001",
      "title": "Python Programming Fundamentals",
      "price": 199.99,
      "credit_hour": 3,
      "description": "Learn the basics of Python programming from scratch. In this comprehensive course, you will dive deep into the world of Python, covering everything from basic syntax to advanced topics like data manipulation, web development, and more. By the end of this course, you will have a solid foundation in Python programming and be ready to tackle real-world projects.",
      "image": "https://i.postimg.cc/2yHNbBKV/python.jpg"
    },
    {
      "id": "SE101",
      "title": "Introduction to Software Engineering",
      "price": 249.99,
      "credit_hour": 4,
      "description": "Explore the fundamental principles of software engineering. This extensive course will take you on a journey through the entire software development lifecycle, from requirements analysis to testing and maintenance. You will learn about software design, architecture, and best practices that are essential for building robust and scalable software systems. Join us and embark on your software engineering adventure today!",
      "image": "https://i.postimg.cc/YS7D7CdV/fotis-fotopoulos-6s-Al6a-Q4-OWI-unsplash.jpg"
    },
    {
      "id": "PL002",
      "title": "Java Programming Mastery",
      "price": 229.99,
      "credit_hour": 3,
      "description": "Master Java programming and object-oriented concepts. This in-depth course will equip you with the skills and knowledge needed to become a Java expert. You will delve into advanced topics like multithreading, GUI programming, and data structures while building real-world Java applications. Whether you're a beginner or an experienced programmer, this course has something to offer for everyone.",
      "image": "https://i.postimg.cc/7Z5JL3WJ/java.jpg"
    },
    {
      "id": "SE201",
      "title": "Software Design Patterns",
      "price": 299.99,
      "credit_hour": 4,
      "description": "Learn popular software design patterns and best practices. In this extensive and comprehensive course, you will not only understand the theory behind design patterns but also apply them to real-world software projects. You will gain hands-on experience in crafting elegant and maintainable code. Don't miss this opportunity to elevate your software design skills!",
      "image": "https://i.postimg.cc/gc3ff1cn/design.jpg"
    },
    {
      "id": "PL003",
      "title": "Web Development with JavaScript",
      "price": 199.99,
      "credit_hour": 3,
      "description": "Build dynamic web applications using JavaScript. This immersive course will take you on a journey through the world of web development. You will learn about client-side scripting, DOM manipulation, and server-side integration. By the end of the course, you'll have the skills to create interactive and responsive web applications that users will love.",
      "image": "https://i.postimg.cc/9F7r5mRy/js.jpg"
    },
    {
      "id": "SE301",
      "title": "Agile Software Development",
      "price": 279.99,
      "credit_hour": 4,
      "description": "Implement agile methodologies in software development. This comprehensive course will teach you the principles and practices of agile software development. You will gain hands-on experience with agile frameworks like Scrum and Kanban, enabling you to lead agile teams and deliver high-quality software products efficiently. Join us on the path to agile excellence!",
      "image": "https://i.postimg.cc/cJpdcYhj/agile.jpg"
    },
    {
      "id": "PL004",
      "title": "C# Programming Essentials",
      "price": 219.99,
      "credit_hour": 3,
      "description": "Get started with C# programming and .NET development. This extensive course is your gateway to the world of C# and .NET. You'll learn the fundamentals of C# language, explore the .NET framework, and build Windows applications. Whether you're aiming to become a desktop application developer or a game developer with Unity, this course is your stepping stone.",
      "image": "https://i.postimg.cc/T1PNLNmX/c-sharp.jpg"
    },
    {
      "id": "SE401",
      "title": "Software Quality Assurance",
      "price": 259.99,
      "credit_hour": 4,
      "description": "Ensure the quality of your software products with testing techniques. This comprehensive course will equip you with the knowledge and skills to ensure the quality of software products. You'll learn various testing methodologies, automation techniques, and best practices. Quality assurance is a critical aspect of software development, and this course will make you an expert in it.",
      "image": "https://i.postimg.cc/8kBrjPPD/quality.jpg"
    },
    {
      "id": "PL005",
      "title": "Ruby on Rails Web Development",
      "price": 209.99,
      "credit_hour": 3,
      "description": "Build web applications with Ruby on Rails framework. In this extensive course, you will dive deep into Ruby on Rails, one of the most popular web development frameworks. You'll create dynamic and database-driven web applications with ease. Whether you're a beginner or an experienced developer, this course will help you harness the power of Ruby on Rails.",
      "image": "https://i.postimg.cc/0j2m9LS7/ruby.png"
    }
  ]
  